# GetCategories Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterFilterElement..::..GetCategories Method
ParameterFilterElement Class See Also
---
Gets the categories admitted by this filter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ICollection<ElementId> GetCategories()
```

Visual Basic
---
```text
Public Function GetCategories As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ GetCategories()
```

# See Also
ParameterFilterElement Class
Autodesk.Revit.DB Namespace